---
kind: property
id: P:Autodesk.Revit.DB.SiteLocation.GeoCoordinateSystemId
source: html/e94730b5-ec7e-d145-849b-6b93a13db024.htm
---
# Autodesk.Revit.DB.SiteLocation.GeoCoordinateSystemId Property

The geographic coordinate system ID, such as "AMG-50" and "Beijing1954/a.GK3d-40".

## Syntax (C#)
```csharp
public string GeoCoordinateSystemId { get; }
```

## Remarks
If the site does not have a geographic coordinate system, it returns an empty string for this property.